<?php

use App\Http\Controllers\MainController;
use App\Http\Controllers\UserController;
use Illuminate\Support\Facades\Route;
use Illuminate\Http\Request;

/*
|--------------------------------------------------------------------------
| Web Routes
|--------------------------------------------------------------------------
|
| Here is where you can register web routes for your application. These
| routes are loaded by the RouteServiceProvider within a group which
| contains the "web" middleware group. Now create something great!
|
*/

Route::get('/', [MainController::class, 'index'])->name('welcome');

Route::get('/login',[UserController::class,'login'])->name('login');
Route::post('/login',[UserController::class,'loginPost']);

Route::get('/register',[UserController::class,'register'])->name('register');
Route::post('/register',[UserController::class,'registerPost']);

Route::middleware('auth')->group(function (){
    Route::get('/static-manager', [MainController::class, 'staticManager'])->name('staticManager');

    Route::get('/users', [UserController::class, 'users'])->name('users');
    Route::get('logout', [UserController::class, 'logout'])->name('logout');
});

Route::get('/test', function (){
    return ('My TEST');
});
Route::get('/reset/{code}', function ($code){
    switch ($code){
        case "ALL":
            return ('Все настройки сброшены');
        case 'SETTING':
            return ('Сброшены настройки');
        default:
            return ('Ключ неверный');
    }
});
Route::get('/my-name/{name}', function ($name){
    return ('Имя - '.$name);
})-> where('name', '[A-Za-z]+');

Route::get('/users', function (){
    $cities = array(
        'Абакан',
        'Азов',
        'Александров',
        'Алексин',
        'Альметьевск',
        'Анапа',
        'Ангарск',
        'Анжеро-Судженск',
        'Апатиты',
        'Арзамас',
        'Армавир',
        'Арсеньев',
        'Артем',
        'Архангельск',
        'Асбест',
        'Астрахань',
        'Ачинск',
        'Балаково',
        'Балахна',
        'Балашиха',
        'Балашов',
        'Барнаул',
        'Батайск',
        'Белгород',
        'Белебей',
        'Белово',
        'Белогорск (Амурская область)',
        'Белорецк',
        'Белореченск',
        'Бердск',
        'Березники',
        'Березовский (Свердловская область)',
        'Бийск',
        'Биробиджан',
        'Благовещенск (Амурская область)',
        'Бор',
        'Борисоглебск',
        'Боровичи',
        'Братск',
        'Брянск',
        'Бугульма',
        'Буденновск',
        'Бузулук',
        'Буйнакск',
        'Великие Луки',
        'Великий Новгород',
        'Верхняя Пышма',
        'Видное',
        'Владивосток',
        'Владикавказ',
        'Владимир',
        'Волгоград',
        'Волгодонск',
        'Волжск',
        'Волжский',
        'Вологда',
        'Вольск',
        'Воркута',
        'Воронеж',
        'Воскресенск',
        'Воткинск',
        'Всеволожск',
        'Выборг',
        'Выкса',
        'Вязьма',
        'Гатчина',
        'Геленджик',
        'Георгиевск',
        'Глазов',
        'Горно-Алтайск',
        'Грозный',
        'Губкин',
        'Гудермес',
        'Гуково',
        'Гусь-Хрустальный',
        'Дербент',
        'Дзержинск',
        'Димитровград',
        'Дмитров',
        'Долгопрудный',
        'Домодедово',
        'Донской',
        'Дубна',
        'Евпатория',
        'Егорьевск',
        'Ейск',
        'Екатеринбург',
        'Елабуга',
        'Елец',
        'Ессентуки',
        'Железногорск (Красноярский край)',
        'Железногорск (Курская область)',
        'Жигулевск',
        'Жуковский',
        'Заречный',
        'Зеленогорск',
        'Зеленодольск',
        'Златоуст',
        'Иваново',
        'Ивантеевка',
        'Ижевск',
        'Избербаш',
        'Иркутск',
        'Искитим',
        'Ишим',
        'Ишимбай',
        'Йошкар-Ола',
        'Казань',
        'Калининград',
        'Калуга',
        'Каменск-Уральский',
        'Каменск-Шахтинский',
        'Камышин',
        'Канск',
        'Каспийск',
        'Кемерово',
        'Керчь',
        'Кинешма',
        'Кириши',
        'Киров (Кировская область)',
        'Кирово-Чепецк',
        'Киселевск',
        'Кисловодск',
        'Клин',
        'Клинцы',
        'Ковров',
        'Когалым',
        'Коломна',
        'Комсомольск-на-Амуре',
        'Копейск',
        'Королев',
        'Кострома',
        'Котлас',
        'Красногорск',
        'Краснодар',
        'Краснокаменск',
        'Краснокамск',
        'Краснотурьинск',
        'Красноярск',
        'Кропоткин',
        'Крымск',
        'Кстово',
        'Кузнецк',
        'Кумертау',
        'Кунгур',
        'Курган',
        'Курск',
        'Кызыл',
        'Лабинск',
        'Лениногорск',
        'Ленинск-Кузнецкий',
        'Лесосибирск',
        'Липецк',
        'Лиски',
        'Лобня',
        'Лысьва',
        'Лыткарино',
        'Люберцы',
        'Магадан',
        'Магнитогорск',
        'Майкоп',
        'Махачкала',
        'Междуреченск',
        'Мелеуз',
        'Миасс',
        'Минеральные Воды',
        'Минусинск',
        'Михайловка',
        'Михайловск (Ставропольский край)',
        'Мичуринск',
        'Москва',
        'Мурманск',
        'Муром',
        'Мытищи',
        'Набережные Челны',
        'Назарово',
        'Назрань',
        'Нальчик',
        'Наро-Фоминск',
        'Находка',
        'Невинномысск',
        'Нерюнгри',
        'Нефтекамск',
        'Нефтеюганск',
        'Нижневартовск',
        'Нижнекамск',
        'Нижний Новгород',
        'Нижний Тагил',
        'Новоалтайск',
        'Новокузнецк',
        'Новокуйбышевск',
        'Новомосковск',
        'Новороссийск',
        'Новосибирск',
        'Новотроицк',
        'Новоуральск',
        'Новочебоксарск',
        'Новочеркасск',
        'Новошахтинск',
        'Новый Уренгой',
        'Ногинск',
        'Норильск',
        'Ноябрьск',
        'Нягань',
        'Обнинск',
        'Одинцово',
        'Озерск (Челябинская область)',
        'Октябрьский',
        'Омск',
        'Орел',
        'Оренбург',
        'Орехово-Зуево',
        'Орск',
        'Павлово',
        'Павловский Посад',
        'Пенза',
        'Первоуральск',
        'Пермь',
        'Петрозаводск',
        'Петропавловск-Камчатский',
        'Подольск',
        'Полевской',
        'Прокопьевск',
        'Прохладный',
        'Псков',
        'Пушкино',
        'Пятигорск',
        'Раменское',
        'Ревда',
        'Реутов',
        'Ржев',
        'Рославль',
        'Россошь',
        'Ростов-на-Дону',
        'Рубцовск',
        'Рыбинск',
        'Рязань',
        'Салават',
        'Сальск',
        'Самара',
        'Санкт-Петербург',
        'Саранск',
        'Сарапул',
        'Саратов',
        'Саров',
        'Свободный',
        'Севастополь',
        'Северодвинск',
        'Северск',
        'Сергиев Посад',
        'Серов',
        'Серпухов',
        'Сертолово',
        'Сибай',
        'Симферополь',
        'Славянск-на-Кубани',
        'Смоленск',
        'Соликамск',
        'Солнечногорск',
        'Сосновый Бор',
        'Сочи',
        'Ставрополь',
        'Старый Оскол',
        'Стерлитамак',
        'Ступино',
        'Сургут',
        'Сызрань',
        'Сыктывкар',
        'Таганрог',
        'Тамбов',
        'Тверь',
        'Тимашевск',
        'Тихвин',
        'Тихорецк',
        'Тобольск',
        'Тольятти',
        'Томск',
        'Троицк',
        'Туапсе',
        'Туймазы',
        'Тула',
        'Тюмень',
        'Узловая',
        'Улан-Удэ',
        'Ульяновск',
        'Урус-Мартан',
        'Усолье-Сибирское',
        'Уссурийск',
        'Усть-Илимск',
        'Уфа',
        'Ухта',
        'Феодосия',
        'Фрязино',
        'Хабаровск',
        'Ханты-Мансийск',
        'Хасавюрт',
        'Химки',
        'Чайковский',
        'Чапаевск',
        'Чебоксары',
        'Челябинск',
        'Черемхово',
        'Череповец',
        'Черкесск',
        'Черногорск',
        'Чехов',
        'Чистополь',
        'Чита',
        'Шадринск',
        'Шали',
        'Шахты',
        'Шуя',
        'Щекино',
        'Щелково',
        'Электросталь',
        'Элиста',
        'Энгельс',
        'Южно-Сахалинск',
        'Юрга',
        'Якутск',
        'Ялта',
        'Ярославль'
    );
    return (print_r($cities));
});

Route::get('/settings', function (){
    $opersys = php_uname();
    return ('Я зашёл с браузера: '.$_SERVER['HTTP_USER_AGENT']."<br>"."Ip address: ".$_SERVER['REMOTE_ADDR']."<br>"."Операционная система: ".$opersys);
});
Route::get('/hosting', function (Request $request){
    $input =$request->all();
    return ($input);
});
Route::get('my-settings?{browser}&{ipadd}&{opersys}', function (Request $request){
    $browser = $request->query('browser');
    $ipadd = $request->query('ipadd');
    $opersys = $request->query('opersys');
    return ('Я зашёл с браузера: '.$browser."<br>"."Ip address: ".$_SERVER['REMOTE_ADDR']."<br>"."Операционная система: ".$opersys);
});




Route::get('/infoname/{name}', function ($name){
    return ('Имя - '.$name);
})-> where('name', '[A-Za-z]+');

Route::get('/infoage/{age}', function ($age){
    return ('Возраст - '.$age);
}) -> where('age', '[0-9]{3}||[0-9]{2}||[0-9]{1}+');

Route::get('/working/{name}/{cheto}', function ($name, $cheto) {
    return $name . "<br>" . $cheto;
});

Route::get('/pizza', function (){
    return ('Пицца с моцареллой ');
});
Route::get('/country', function ($age){
    return ('Страна Россия великая держава');
});
Route::get('/friends', function (){
    return ('Мой друганы - Зилибобка и Бёбля');
});

Route::get('/pol', function (){
    return view('index');
});
Route::get('/book', function (){
    $text = '"Все ужасы можно пережить, пока ты просто покоряешься своей судьбе, но попробуй размышлять о них – и они убьют тебя (На западном фронте без перемен, Э. М. Ремарк)"';
    return view('two', compact('text'));
});
Route::get('/words', function (){
    return view('three');
});






